{
    "architectures": [
        "Qwen3OmniMoeForConditionalGeneration"
    ],
    "assistant_token_id": 77091,
    "dtype": "bfloat16",
    "enable_audio_output": false,
    "im_end_token_id": 151645,
    "im_start_token_id": 151644,
    "model_type": "qwen3_omni_moe",
    "system_token_id": 8948,
    "thinker_config": {
        "audio_config": {
            "activation_dropout": 0,
            "activation_function": "gelu",
            "attention_dropout": 0,
            "conv_chunksize": 500,
            "d_model": 1280,
            "downsample_hidden_size": 480,
            "dropout": 0,
            "encoder_attention_heads": 20,
            "encoder_ffn_dim": 5120,
            "encoder_layers": 4,
            "initializer_range": 0.02,
            "max_source_positions": 1500,
            "model_type": "qwen3_omni_moe_audio_encoder",
            "n_window": 50,
            "n_window_infer": 800,
            "num_hidden_layers": 4,
            "num_mel_bins": 128,
            "output_dim": 2048,
            "scale_embedding": false
        },
        "audio_end_token_id": 151670,
        "audio_start_token_id": 151669,
        "audio_token_id": 151675,
        "dtype": "bfloat16",
        "image_token_id": 151655,
        "initializer_range": 0.02,
        "model_type": "qwen3_omni_moe_thinker",
        "position_id_per_seconds": 13,
        "seconds_per_chunk": 2,
        "text_config": {
            "attention_bias": false,
            "attention_dropout": 0.0,
            "bos_token_id": 151643,
            "decoder_sparse_step": 1,
            "dtype": "bfloat16",
            "eos_token_id": 151645,
            "head_dim": 128,
            "hidden_act": "silu",
            "hidden_size": 2048,
            "initializer_range": 0.02,
            "intermediate_size": 768,
            "max_position_embeddings": 65536,
            "mlp_only_layers": [],
            "model_type": "qwen3_omni_moe_text",
            "moe_intermediate_size": 768,
            "norm_topk_prob": true,
            "num_attention_heads": 32,
            "num_experts": 128,
            "num_experts_per_tok": 8,
            "num_hidden_layers": 6,
            "num_key_value_heads": 4,
            "rms_norm_eps": 1e-06,
            "rope_scaling": {
                "interleaved": true,
                "mrope_interleaved": true,
                "mrope_section": [
                    24,
                    20,
                    20
                ],
                "rope_type": "default",
                "type": "default"
            },
            "rope_theta": 1000000,
            "router_aux_loss_coef": 0.001,
            "shared_expert_intermediate_size": 0,
            "use_cache": true,
            "use_qk_norm": true,
            "use_sliding_window": false,
            "vocab_size": 152064
        },
        "user_token_id": 872,
        "video_token_id": 151656,
        "vision_config": {
            "apply_vit_abs_pos_embed": true,
            "deepstack_visual_indexes": [
                1,
                2,
                3
            ],
            "depth": 4,
            "hidden_act": "gelu_pytorch_tanh",
            "hidden_size": 1152,
            "in_channels": 3,
            "in_chans": 3,
            "initializer_range": 0.02,
            "intermediate_size": 4304,
            "model_type": "qwen3_omni_moe_vision_encoder",
            "num_heads": 16,
            "out_hidden_size": 2048,
            "patch_size": 16,
            "spatial_merge_size": 2,
            "spatial_patch_size": 16,
            "temporal_patch_size": 2,
            "tokens_per_second": 2
        },
        "vision_end_token_id": 151653,
        "vision_start_token_id": 151652
    },
    "transformers_version": "4.57.0.dev0",
    "tts_bos_token_id": 151672,
    "tts_eos_token_id": 151673,
    "tts_pad_token_id": 151671,
    "user_token_id": 872
}
